interface SlidesData {
  id: number;
  avatar: string;
  name: string;
  position: string;
  comment: string;
}

const slidesData: SlidesData[] = [
  { id: 0, avatar: "images/zhechka-dirova.png", name: "Жечка Дырова", position: "Корреспондент 9 канала",
    comment: "Я слежу за Абобой больше 5 лет и всегда поддерживаю его! Абоба – мой кандидат, кандидат от народа." },
  { id: 1, avatar: "images/alla-hanet.png", name: "Алла Ханет", position: "Хореограф",
    comment: "Абоба постоянно проводит адресную помощь! вот недавно построил \
              нам сарай! Но он сгорел от плохой проводки." },
  { id: 2, avatar: "images/kate-lollipop.png", name: "Катя Леденец", position: "9-летняя девочка",
    comment: "Мой муж Саша Ситинез работает в штабе Абобы в Саранске \
              и уже долгое время мы боремся за права граждан, но не \
              животных – кошек нам не жалко." },
  { id: 3, avatar: "images/fotolup-urist.png", name: "Никита Игоревич", position: "Юрист",
    comment: "Абоба на протяжении 3 лет звонил мне, а сейчас я играю в PUBG, а он идет в президенты. \
              Это отличный пример взаимодействия, я займу его место и буду воровать донатики, а он \
              будет занят президентской кампанией, поэтому голосуйте за Абобу!" },
  { id: 4, avatar: "images/fotolup-fikalis.png", name: "Антон Фикалис", position: "Иммигрант",
    comment: "В настоящее время мои права ущемляют в нашей стране. Абоба обещает исправить это \
              и дать равные права людям с любым цветом кожи." },
  { id: 5, avatar: "images/maslack.jpeg", name: "Маслак 54", position: "Учащийся пятого класса",
    comment: "хихихихих я маслак купите мне лего, ВОТ ПРИ АБОБЕ У КАЖДОГО ЖЕЛАЮЩЕГО БУДЕТ ЛЕГО" },
  { id: 6, avatar: "images/alex.png", name: "Александр Курячий", position: "Наркоман",
    comment: "Я Александр Курячий и я не хочу, чтобы СХС муачал кошек! Абоба \
              такое не одобряет, поэтому я за него и голосую. Подпишите \
              мою петицию: %link%" },
  { id: 7, avatar: "images/polina-polyakova.png", name: "Полина Полякова", position: "Бетономешальшица",
    comment: "Я работаю в Святом Кургане бетономешальшицей и получаю за это копейки. \
              Я голосую за Абобу, потому что он обещает исправить положение работающих \
              женщин в стране." },
  { id: 8, avatar: "images/probably-krol.jpeg", name: "Пробаблу", position: "Кролик",
    comment: "Хрум 🥕 хрум 🥕 хрум 🥕 хрум 🥕 бан тебе школьник 🥕 хрум 🥕 хрум у \
              меня есть бот в телеграме @ProbablyKrolBot" },
  { id: 9, avatar: "images/kypcop-avatar.jpeg", name: "Курсор", position: "Мадиратар и олд СХС",
    comment: "Абоба- это сила. Я в этом убедился лично. \
              Как то раз я плюнул на землю....и не кто не смог поднять, кроме Абобы!" },
]

export default slidesData